
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ПреподавательскийСоставГрупп
	Движения.ПреподавательскийСоставГрупп.Записывать = Истина;
	Для Каждого ТекСтрокаПреподаватели Из Преподаватели Цикл
		Движение = Движения.ПреподавательскийСоставГрупп.Добавить();
		Движение.Период = Дата;
		Движение.УчебнаяГруппа = УчебнаяГруппа;
		Движение.Преподаватель = ТекСтрокаПреподаватели.Преподаватель;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
