
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр СоставГрупп
	Движения.СоставГрупп.Записывать = Истина;
	Для Каждого ТекСтрокаУчащиеся Из Учащиеся Цикл
		Движение = Движения.СоставГрупп.Добавить();
		Движение.Период = Дата;
		Движение.УчебнаяГруппа = УчебнаяГруппа;
		Движение.Учащийся = ТекСтрокаУчащиеся.Учащийся;
		Движение.Зачислен = Истина;
	КонецЦикла;

	// регистр ЗачислениеУчащихся
	Движения.ЗачислениеУчащихся.Записывать = Истина;
	Для Каждого ТекСтрокаУчащиеся Из Учащиеся Цикл
		Движение = Движения.ЗачислениеУчащихся.Добавить();
		Движение.УчебнаяГруппа = УчебнаяГруппа;
		Движение.Учащийся = ТекСтрокаУчащиеся.Учащийся;
		Движение.ДатаЗачисления = Дата;
		Движение.ДокументОснованиеЗачисления = ТекСтрокаУчащиеся.ДокументОснованиеЗачисления;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
