
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ЗаданияДляГрупп
	Движения.ЗаданияДляГрупп.Записывать = Истина;
	Движение = Движения.ЗаданияДляГрупп.Добавить();
	Движение.УчебнаяГруппа = УчебнаяГруппа;
	Движение.НаименованиеЗадания = НаименованиеЗадания;
	Движение.ОписаниеЗадания = ОписаниеЗадания;
	Движение.ДатаВыдачи = ДатаВыдачи;
	Движение.ДатаСдачи = ДатаСдачи;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
