
&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Пользователь = ПользователиИнформационнойБазы.НайтиПоИмени(Объект.Наименование);
	
	Если Пользователь = Неопределено Тогда
		Пользователь = ПользователиИнформационнойБазы.СоздатьПользователя();	
	КонецЕсли;
	
	Пользователь.АдресЭлектроннойПочты = Объект.ФизическоеЛицо.Email;
	Пользователь.Имя = Объект.Наименование;
	Пользователь.ПолноеИмя = Объект.ФизическоеЛицо.Наименование;
	Пользователь.Пароль = Объект.Пароль;
	Пользователь.ПоказыватьВСпискеВыбора = Объект.ПоказыватьВСпискеВыбора;
	Пользователь.Роли.Очистить();
	
	Для Каждого Роль Из Роли Цикл
		Если Роль.Доступ Тогда
			Пользователь.Роли.Добавить(Метаданные.Роли.Найти(Роль.НаименованиеРоли));	
		КонецЕсли;	
	КонецЦикла;
	
	Пользователь.Записать();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Для каждого Роль из Метаданные.Роли Цикл
		Если СтрНачинаетсяС(Роль.Представление(), "___") Тогда
			Продолжить;
		КонецЕсли;
		СтрокаТЧ = Роли.Добавить();
		
		Если ПользователиИнформационнойБазы.НайтиПоИмени(Объект.Наименование).Роли.Содержит(Роль) Тогда
			СтрокаТЧ.Доступ = Истина;	
		КонецЕсли;
		СтрокаТЧ.НаименованиеРоли = Роль.Представление();
	КонецЦикла;
КонецПроцедуры
