
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УчебныеГруппы.Параметры.УстановитьЗначениеПараметра("Преподаватель",Справочники.Преподаватели.НайтиПоРеквизиту("ФизическоеЛицо",ПараметрыСеанса.ТекущееФЛ));
	Элементы.Приветствие.Заголовок = "Здравствуйте, " + ПараметрыСеанса.ТекущееФЛ.Наименование + "!";
КонецПроцедуры

&НаСервере
Процедура УчебныеГруппыВыборНаСервере(Группа)
	СоставГруппы.Параметры.УстановитьЗначениеПараметра("УчебнаяГруппа",Группа);
	ЗаданияГруппы.Параметры.УстановитьЗначениеПараметра("УчебнаяГруппа",Группа);
	ЗаданияГруппы.Параметры.УстановитьЗначениеПараметра("ДатаСдачи",ТекущаяДата());
КонецПроцедуры

&НаКлиенте
Процедура УчебныеГруппыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Группа = Элемент.ТекущиеДанные.УчебнаяГруппа;
	УчебныеГруппыВыборНаСервере(Группа);
КонецПроцедуры
